IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/ECC_AGG_R5SS1_CORE1_ECC_AGG_R5SS1_CORE1.xml
	<register id="ECC_AGG_R5SS1_CORE1_DED_ENABLE_SET_REG0" acronym="ECC_AGG_R5SS1_CORE1_DED_ENABLE_SET_REG0" offset="0x180" width="32" description="">
		<bitfield id="CPU1_KS_VIM_RAMECC_ENABLE_SET" width="1" begin="27" end="27" resetval="0x0" description="Interrupt Enable Set Register for cpu1_ks_vim_ramecc_pend" range="27" rwaccess="RW"/> 
		<bitfield id="B1TCM1_BANK1_ENABLE_SET" width="1" begin="26" end="26" resetval="0x0" description="Interrupt Enable Set Register for b1tcm1_bank1_pend" range="26" rwaccess="RW"/> 
		<bitfield id="B1TCM1_BANK0_ENABLE_SET" width="1" begin="25" end="25" resetval="0x0" description="Interrupt Enable Set Register for b1tcm1_bank0_pend" range="25" rwaccess="RW"/> 
		<bitfield id="B0TCM1_BANK1_ENABLE_SET" width="1" begin="24" end="24" resetval="0x0" description="Interrupt Enable Set Register for b0tcm1_bank1_pend" range="24" rwaccess="RW"/> 
		<bitfield id="B0TCM1_BANK0_ENABLE_SET" width="1" begin="23" end="23" resetval="0x0" description="Interrupt Enable Set Register for b0tcm1_bank0_pend" range="23" rwaccess="RW"/> 
		<bitfield id="ATCM1_BANK1_ENABLE_SET" width="1" begin="22" end="22" resetval="0x0" description="Interrupt Enable Set Register for atcm1_bank1_pend" range="22" rwaccess="RW"/> 
		<bitfield id="ATCM1_BANK0_ENABLE_SET" width="1" begin="21" end="21" resetval="0x0" description="Interrupt Enable Set Register for atcm1_bank0_pend" range="21" rwaccess="RW"/> 
		<bitfield id="CPU1_DDATA_RAM7_ENABLE_SET" width="1" begin="20" end="20" resetval="0x0" description="Interrupt Enable Set Register for cpu1_ddata_ram7_pend" range="20" rwaccess="RW"/> 
		<bitfield id="CPU1_DDATA_RAM6_ENABLE_SET" width="1" begin="19" end="19" resetval="0x0" description="Interrupt Enable Set Register for cpu1_ddata_ram6_pend" range="19" rwaccess="RW"/> 
		<bitfield id="CPU1_DDATA_RAM5_ENABLE_SET" width="1" begin="18" end="18" resetval="0x0" description="Interrupt Enable Set Register for cpu1_ddata_ram5_pend" range="18" rwaccess="RW"/> 
		<bitfield id="CPU1_DDATA_RAM4_ENABLE_SET" width="1" begin="17" end="17" resetval="0x0" description="Interrupt Enable Set Register for cpu1_ddata_ram4_pend" range="17" rwaccess="RW"/> 
		<bitfield id="CPU1_DDATA_RAM3_ENABLE_SET" width="1" begin="16" end="16" resetval="0x0" description="Interrupt Enable Set Register for cpu1_ddata_ram3_pend" range="16" rwaccess="RW"/> 
		<bitfield id="CPU1_DDATA_RAM2_ENABLE_SET" width="1" begin="15" end="15" resetval="0x0" description="Interrupt Enable Set Register for cpu1_ddata_ram2_pend" range="15" rwaccess="RW"/> 
		<bitfield id="CPU1_DDATA_RAM1_ENABLE_SET" width="1" begin="14" end="14" resetval="0x0" description="Interrupt Enable Set Register for cpu1_ddata_ram1_pend" range="14" rwaccess="RW"/> 
		<bitfield id="CPU1_DDATA_RAM0_ENABLE_SET" width="1" begin="13" end="13" resetval="0x0" description="Interrupt Enable Set Register for cpu1_ddata_ram0_pend" range="13" rwaccess="RW"/> 
		<bitfield id="CPU1_DDIRTY_RAM_ENABLE_SET" width="1" begin="12" end="12" resetval="0x0" description="Interrupt Enable Set Register for cpu1_ddirty_ram_pend" range="12" rwaccess="RW"/> 
		<bitfield id="CPU1_DTAG_RAM3_ENABLE_SET" width="1" begin="11" end="11" resetval="0x0" description="Interrupt Enable Set Register for cpu1_dtag_ram3_pend" range="11" rwaccess="RW"/> 
		<bitfield id="CPU1_DTAG_RAM2_ENABLE_SET" width="1" begin="10" end="10" resetval="0x0" description="Interrupt Enable Set Register for cpu1_dtag_ram2_pend" range="10" rwaccess="RW"/> 
		<bitfield id="CPU1_DTAG_RAM1_ENABLE_SET" width="1" begin="9" end="9" resetval="0x0" description="Interrupt Enable Set Register for cpu1_dtag_ram1_pend" range="9" rwaccess="RW"/> 
		<bitfield id="CPU1_DTAG_RAM0_ENABLE_SET" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Enable Set Register for cpu1_dtag_ram0_pend" range="8" rwaccess="RW"/> 
		<bitfield id="CPU1_IDATA_BANK3_ENABLE_SET" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Enable Set Register for cpu1_idata_bank3_pend" range="7" rwaccess="RW"/> 
		<bitfield id="CPU1_IDATA_BANK2_ENABLE_SET" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Set Register for cpu1_idata_bank2_pend" range="6" rwaccess="RW"/> 
		<bitfield id="CPU1_IDATA_BANK1_ENABLE_SET" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Set Register for cpu1_idata_bank1_pend" range="5" rwaccess="RW"/> 
		<bitfield id="CPU1_IDATA_BANK0_ENABLE_SET" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Set Register for cpu1_idata_bank0_pend" range="4" rwaccess="RW"/> 
		<bitfield id="CPU1_ITAG_RAM3_ENABLE_SET" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Set Register for cpu1_itag_ram3_pend" range="3" rwaccess="RW"/> 
		<bitfield id="CPU1_ITAG_RAM2_ENABLE_SET" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Set Register for cpu1_itag_ram2_pend" range="2" rwaccess="RW"/> 
		<bitfield id="CPU1_ITAG_RAM1_ENABLE_SET" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Set Register for cpu1_itag_ram1_pend" range="1" rwaccess="RW"/> 
		<bitfield id="CPU1_ITAG_RAM0_ENABLE_SET" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Set Register for cpu1_itag_ram0_pend" range="0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_R5SS1_CORE1_DED_ENABLE_CLR_REG0" acronym="ECC_AGG_R5SS1_CORE1_DED_ENABLE_CLR_REG0" offset="0x1C0" width="32" description="">
		<bitfield id="CPU1_KS_VIM_RAMECC_ENABLE_CLR" width="1" begin="27" end="27" resetval="0x0" description="Interrupt Enable Clear Register for cpu1_ks_vim_ramecc_pend" range="27" rwaccess="RW"/> 
		<bitfield id="B1TCM1_BANK1_ENABLE_CLR" width="1" begin="26" end="26" resetval="0x0" description="Interrupt Enable Clear Register for b1tcm1_bank1_pend" range="26" rwaccess="RW"/> 
		<bitfield id="B1TCM1_BANK0_ENABLE_CLR" width="1" begin="25" end="25" resetval="0x0" description="Interrupt Enable Clear Register for b1tcm1_bank0_pend" range="25" rwaccess="RW"/> 
		<bitfield id="B0TCM1_BANK1_ENABLE_CLR" width="1" begin="24" end="24" resetval="0x0" description="Interrupt Enable Clear Register for b0tcm1_bank1_pend" range="24" rwaccess="RW"/> 
		<bitfield id="B0TCM1_BANK0_ENABLE_CLR" width="1" begin="23" end="23" resetval="0x0" description="Interrupt Enable Clear Register for b0tcm1_bank0_pend" range="23" rwaccess="RW"/> 
		<bitfield id="ATCM1_BANK1_ENABLE_CLR" width="1" begin="22" end="22" resetval="0x0" description="Interrupt Enable Clear Register for atcm1_bank1_pend" range="22" rwaccess="RW"/> 
		<bitfield id="ATCM1_BANK0_ENABLE_CLR" width="1" begin="21" end="21" resetval="0x0" description="Interrupt Enable Clear Register for atcm1_bank0_pend" range="21" rwaccess="RW"/> 
		<bitfield id="CPU1_DDATA_RAM7_ENABLE_CLR" width="1" begin="20" end="20" resetval="0x0" description="Interrupt Enable Clear Register for cpu1_ddata_ram7_pend" range="20" rwaccess="RW"/> 
		<bitfield id="CPU1_DDATA_RAM6_ENABLE_CLR" width="1" begin="19" end="19" resetval="0x0" description="Interrupt Enable Clear Register for cpu1_ddata_ram6_pend" range="19" rwaccess="RW"/> 
		<bitfield id="CPU1_DDATA_RAM5_ENABLE_CLR" width="1" begin="18" end="18" resetval="0x0" description="Interrupt Enable Clear Register for cpu1_ddata_ram5_pend" range="18" rwaccess="RW"/> 
		<bitfield id="CPU1_DDATA_RAM4_ENABLE_CLR" width="1" begin="17" end="17" resetval="0x0" description="Interrupt Enable Clear Register for cpu1_ddata_ram4_pend" range="17" rwaccess="RW"/> 
		<bitfield id="CPU1_DDATA_RAM3_ENABLE_CLR" width="1" begin="16" end="16" resetval="0x0" description="Interrupt Enable Clear Register for cpu1_ddata_ram3_pend" range="16" rwaccess="RW"/> 
		<bitfield id="CPU1_DDATA_RAM2_ENABLE_CLR" width="1" begin="15" end="15" resetval="0x0" description="Interrupt Enable Clear Register for cpu1_ddata_ram2_pend" range="15" rwaccess="RW"/> 
		<bitfield id="CPU1_DDATA_RAM1_ENABLE_CLR" width="1" begin="14" end="14" resetval="0x0" description="Interrupt Enable Clear Register for cpu1_ddata_ram1_pend" range="14" rwaccess="RW"/> 
		<bitfield id="CPU1_DDATA_RAM0_ENABLE_CLR" width="1" begin="13" end="13" resetval="0x0" description="Interrupt Enable Clear Register for cpu1_ddata_ram0_pend" range="13" rwaccess="RW"/> 
		<bitfield id="CPU1_DDIRTY_RAM_ENABLE_CLR" width="1" begin="12" end="12" resetval="0x0" description="Interrupt Enable Clear Register for cpu1_ddirty_ram_pend" range="12" rwaccess="RW"/> 
		<bitfield id="CPU1_DTAG_RAM3_ENABLE_CLR" width="1" begin="11" end="11" resetval="0x0" description="Interrupt Enable Clear Register for cpu1_dtag_ram3_pend" range="11" rwaccess="RW"/> 
		<bitfield id="CPU1_DTAG_RAM2_ENABLE_CLR" width="1" begin="10" end="10" resetval="0x0" description="Interrupt Enable Clear Register for cpu1_dtag_ram2_pend" range="10" rwaccess="RW"/> 
		<bitfield id="CPU1_DTAG_RAM1_ENABLE_CLR" width="1" begin="9" end="9" resetval="0x0" description="Interrupt Enable Clear Register for cpu1_dtag_ram1_pend" range="9" rwaccess="RW"/> 
		<bitfield id="CPU1_DTAG_RAM0_ENABLE_CLR" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Enable Clear Register for cpu1_dtag_ram0_pend" range="8" rwaccess="RW"/> 
		<bitfield id="CPU1_IDATA_BANK3_ENABLE_CLR" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Enable Clear Register for cpu1_idata_bank3_pend" range="7" rwaccess="RW"/> 
		<bitfield id="CPU1_IDATA_BANK2_ENABLE_CLR" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Clear Register for cpu1_idata_bank2_pend" range="6" rwaccess="RW"/> 
		<bitfield id="CPU1_IDATA_BANK1_ENABLE_CLR" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Clear Register for cpu1_idata_bank1_pend" range="5" rwaccess="RW"/> 
		<bitfield id="CPU1_IDATA_BANK0_ENABLE_CLR" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Clear Register for cpu1_idata_bank0_pend" range="4" rwaccess="RW"/> 
		<bitfield id="CPU1_ITAG_RAM3_ENABLE_CLR" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Clear Register for cpu1_itag_ram3_pend" range="3" rwaccess="RW"/> 
		<bitfield id="CPU1_ITAG_RAM2_ENABLE_CLR" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Clear Register for cpu1_itag_ram2_pend" range="2" rwaccess="RW"/> 
		<bitfield id="CPU1_ITAG_RAM1_ENABLE_CLR" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Clear Register for cpu1_itag_ram1_pend" range="1" rwaccess="RW"/> 
		<bitfield id="CPU1_ITAG_RAM0_ENABLE_CLR" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Clear Register for cpu1_itag_ram0_pend" range="0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_R5SS1_CORE1_AGGR_ENABLE_SET" acronym="ECC_AGG_R5SS1_CORE1_AGGR_ENABLE_SET" offset="0x200" width="8" description="">
		<bitfield id="TIMEOUT" width="1" begin="1" end="1" resetval="0x0" description="interrupt enable set for svbus timeout errors" range="1" rwaccess="RW"/> 
		<bitfield id="PARITY" width="1" begin="0" end="0" resetval="0x0" description="interrupt enable set for parity errors" range="0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_R5SS1_CORE1_AGGR_ENABLE_CLR" acronym="ECC_AGG_R5SS1_CORE1_AGGR_ENABLE_CLR" offset="0x204" width="8" description="">
		<bitfield id="TIMEOUT" width="1" begin="1" end="1" resetval="0x0" description="interrupt enable clear for svbus timeout errors" range="1" rwaccess="RW"/> 
		<bitfield id="PARITY" width="1" begin="0" end="0" resetval="0x0" description="interrupt enable clear for parity errors" range="0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_R5SS1_CORE1_AGGR_STATUS_SET" acronym="ECC_AGG_R5SS1_CORE1_AGGR_STATUS_SET" offset="0x208" width="8" description="">
		<bitfield id="TIMEOUT" width="2" begin="3" end="2" resetval="0x0" description="interrupt status set for svbus timeout errors" range="3 - 2" rwaccess="RW
	  			 INCR"/> 
		<bitfield id="PARITY" width="2" begin="1" end="0" resetval="0x0" description="interrupt status set for parity errors" range="1 - 0" rwaccess="RW
	  			 INCR"/>
	</register>
	<register id="ECC_AGG_R5SS1_CORE1_AGGR_STATUS_CLR" acronym="ECC_AGG_R5SS1_CORE1_AGGR_STATUS_CLR" offset="0x20C" width="8" description="">
		<bitfield id="TIMEOUT" width="2" begin="3" end="2" resetval="0x0" description="interrupt status clear for svbus timeout errors" range="3 - 2" rwaccess="RW
	  			 DECR"/> 
		<bitfield id="PARITY" width="2" begin="1" end="0" resetval="0x0" description="interrupt status clear for parity errors" range="1 - 0" rwaccess="RW
	  			 DECR"/>
	</register>
</module>